app/views/home/saved.html.erb

SELECT "games".* FROM "games"
---

                <% Game.all.each do |game| %>

SELECT COUNT(*) FROM "games"
---
    <%= flash[:notice] if flash[:notice] %>
    "Current number of Games" <%= Game.all.count %>