app/controllers/home_controller.rb

  def solvedGame
    @game =  Game.find_by_id(params[:game])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 21]]

def deleteGame
Game.destroy(params[:game])
---
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 19]]

    def tokenize
       if letter
           #store the input game in the db
           @new_game = Game.create!(f1: params[:letters][:"0"], f2: params[:letters][:"1"], f3: params[:letters][:"2"], f4: params[:letters][:"3"], f5: params[:letters][:"4"], f6: params[:letters][:"5"], f7: params[:letters][:"6"], f8: params[:letters][:"7"], f9: params[:letters][:"8"], f10: params[:letters][:"9"], f11: params[:letters][:"10"], f12: params[:letters][:"11"], f13: params[:letters][:"12"], f14: params[:letters][:"13"], f15: params[:letters][:"14"], f16: params[:letters][:"15"], user_id: current_user.id, gameName: params[:game])
---
INSERT INTO "games" ("f1", "f2", "f3", "f4", "f5", "f6", "f7", "f8", "f9", "f10", "f11", "f12", "f13", "f14", "f15", "f16", "user_id", "gameName", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)